/**********************************************************************************
 * 7. 整数反转
 * 
 * 给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。
 * 
 * 示例 1:
 *      输入: 123
 *      输出: 321
 * 
 * 示例 2:
 *      输入: -123
 *      输出: -321
 * 
 * 示例 3:
 *      输入: 120
 *      输出: 21
 * 
 * 注意:
 * 假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−231,  231 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0。

 **********************************************************************************/
/**
 * @param {number} x
 * @return {number}
 */
var reverse = function(x) {
    if(!x){
        return 0
    }
    let fu = false;
    if(x < 0){
        x = -x;
        fu = true;
        
        
    }
    x = x + '';
        x = x.split('');
    console.log(x);
        x = x.reverse();  console.log(x);
    x = x.join('');  console.log(x);
        x = parseInt(x);  console.log(x);
        
    if(fu){
        x = -x;
    }
    if(x < -2147483648) return 0
    if(x > 2147483647) return 0
    return x
};
